const inventory = [];
let room = "вход";
let time = 0;

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст.");
    } else {
        alert("В рюкзаке: " + inventory.join(", "));
    }
}

alert(
    "Проект амнезия\n\n" +
    "собрать по облокам крупицы память и выяснить что твориться в коплексе\n" +
    "ключ карты(6), документы, фотографии и папка с личным делом."
);
while (time < 100) {
    if (room === "вход") {
        const choice = confirm("вы находитесь в глубоком, не желаете ли вы проснуться?")
        if (choice) {
            alert("вы просыпаетсь в тусклой освещеной палате\n" +
                "вы осматриваете комнату и видите приоткрытую дверь"
            )
            room = "коридор"
        }
        else {
            break
        }
    }
    else if (room === "коридор") {
        alert("вы вышли из палаты в коридор\n" +
            "коридор пуст слышно только работу ламп в его конце освещающего выход\n" +
            "передо мной выбор пойти к выходу или же осмотреть соседние палаты"
        )
        const choice = prompt("Коридор\n" +
            "0 - 1 палата\n" +
            "1 - 2 палата\n" +
            "2 - выход из коридора"
        )
        if (choice === "0") {
            alert("обсмотрев палату 1 вы заметили надпись на стене:Выхода нет")
        }
        else if (choice === "1") {
            alert("обсмотрев палату 2 вы нашли часть дела некого Тедди Дэниелс\n" +
                "открыв его я обнаружил что это я \n" +
                "я понял что я был пациентом этой клиники \n" +
                "но почему я здесь один и больница выглядит заброшенной я так и не выяснил"
            )
        }
        else if(choice === "2") {
            room === "главный зал"

        }
    }
    else if (room === "главный зал") {
        const choice = prompt("я вышел в главный зал\n" +
            "0 - дверь к медсестре\n" +
            "1 - кухня\n" +
            "2 - дверь наверх\n" +
            "3 - склад\n" +
            "4 - служебное помещение"
        )
        if(choice === "0"){
            alert("дверь легко открылась"+
                ""
            )
        }
    }
}