const inventory = [];
let room = "вход";
let time = 0;

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст.");
    } else {
        alert("В рюкзаке: " + inventory.join(", "));
    }
}

alert(
    "Проект амнезия\n\n" +
    "собрать по облокам крупицы память и выяснить что твориться в коплексе\n" +
    "ключ карты(6), документы, фотографии и папка с личным делом."
);
while (time < 100) {
    if (room === "вход") {
        const choice = confirm("вы находитесь в глубоком, не желаете ли вы проснуться?")
        if (choice) {
            alert("вы просыпаетсь в тусклой освещеной палате\n" +
                "вы осматриваете комнату и видите приоткрытую дверь"
            )
            room = "коридор"
        }
        else {
            break
        }
    }
    else if (room === "коридор") {
        alert("вы вышли из палаты в коридор\n" +
            "коридор пуст слышно только работу ламп в его конце освещающего выход\n" +
            "передо мной выбор пойти к выходу или же осмотреть соседние палаты"
        )
        const choice = prompt("Коридор\n" +
            "0 - 1 палата\n" +
            "1 - 2 палата\n" +
            "2 - выход из коридора"
        )
        if (choice === "0") {
            alert("обсмотрев палату 1 вы заметили надпись на стене:Выхода нет")
        }
        else if (choice === "1") {
            alert("обсмотрев палату 2 вы нашли часть дела некого Тедди Дэниелс\n" +
                "открыв его я обнаружил что это я \n" +
                "я понял что я был пациентом этой клиники \n" +
                "но почему я здесь один и больница выглядит заброшенной я так и не выяснил"
            )
        }
        else if(choice === "2") {
            room === "главный зал"

        }
    }
    else if (room === "главный зал") {
        const choice = prompt("я вышел в главный зал\n" +
            "0 - дверь к медсестре\n" +
            "1 - кухня\n" +
            "2 - дверь наверх\n" +
            "3 - склад\n" +
            "4 - служебное помещение"
        )
         if(choice === "0"){
            alert("дверь легко открылась\n"+
                "там я обнаружил вторую часть своего дела\n"+
                "откуда я узнал ,что тяжело болен и вскоре умру если мне не оказать должного лечения\n"+
                "в виде андидота"
            )
            time = time + 1;
        }
        else if(choice === "1"){
            alert("я проешл на кужню там я услышал шум\n"+
                "я пошел на звук и обнаружил рацию\n"+
                "Рация:приём здесь кто нибудь есть\n"+
                "Я:здраствуйте тут есть я\n"+
                "Рация:представтесь\n"+
                "Я: Тедди Дэниелс\n"+
                "тут раздался шум и наша связь оборвалась"
            )
        }
        else if (choice === "3"){
            alert("склад\n"+
                "на верхеней полки вы замечаете ящик вы пониматет что там есть то что вам нужно\n"+
                "теперь моя задача как либо его достать\n"+
                "надо бы осмотерться\n"+
                "вы обнаружили: ящики, веревку, лестницу "
            )
            const action = prompt("0 - воспользоваться ящиками\n"+
                "1 - вопользоваться веревкой\n"+
                "2 - воспользоваться лестницей\n"+
                "3 - воспользоваться ящиками и веревкой"
            )
            if(action === "0"){
                alert("вы не смогли достичь своей цели")

            }
            else if( action === "1"){
                alert("ПОТРАЧЕНО\n"+
                    "P.s вы повелись от невыносимой легкости бытия"
                )
                break
            }
            else if( action === "2"){
                alert("ПОТРАЧЕНО\n"+
                    "P.s лестница стоит давно она уже не может выдержить человека"
                )
                break
            }
            else if (action === "3"){
                alert("вы смогли забраться и дсотичь своей цели")
                inventory.push("ключ карта")
            }
            else if(choice === "2" && inventory.includes("ключ карта")){
            alert("")
           
            room = "2 этаж"
        }
        }
        else if(choice === "4"){
            alert("тут со мной опять вышли на связь\n"+
                "Рация: Вы меня слышите, вам нужно срочно бежать тут не безопастно* Шум\n"+
                "Я:почему\n"+
                "Рация: комплекс скоро рухнет вам нужно бежать но не бойтесь мы поможем вам за одну услугу \n"+
                "Я:какую \n"+
                "Рация: вам нужно удалить данные с компьютера но пред этим скопировать их и вынести\n"+
                "Я: я так понимаю это  выбор без выбора\n"+
                "Рация: вы правильно поняли, конец связи\n"
            )
        }
    }
    else if(romm === "2 этаж"){
        const choice = prompt("вы прошли на 2 этаж пред вами\n"+
            "0 - комнат сис админа\n"+
            "1 - серверная \n"+
            "2 - рабочий зал\n"+
            "3 - на третий этаж\n"
        )
        if( choice === "0"){
            alert("вы прошли в комнату сис админа \n"+
                "здесь по вашему мнению есть флешка для того что бы скачать файлы\n"+
                "вам надо обыскать комнату"
            )
            const action = prompt(
                "0 - я могу обыскать тсчательно но долго\n"+
                "1 - или же мельком но быстро"
            )
            if(action === "0"){
                alert("для того что бы обыскать комнату надо расшифровать шифр, вот легенда:\n"+
                    "$=К, %=О, ^=Ш, &=А, #=В, @=Т, !=Е, ?=Р, <=С, >=М\n"+
                    "^%$$%&%"
                )
                const sole= prompt()
                if(sole === "кошелек"){
                    alert("")
                    inventory.push("флешка")
                }
                else{
                    alert("ты не смог ничего найти")
                }
            }
            else if(action === "1"){
                 alert("для того что бы обыскать комнату надо расшифровать шифр, вот легенда:\n"+
                    "$=К, %=О, ^=Ш, &=А, #=В, @=Т, !=Е, ?=Р, <=С, >=М\n"+
                    "#!?!?"
                )
                const sole= prompt()
                if(sole === "ветер"){
                    alert("")
                    inventory.push("флешка")
                }
                else{
                    alert("ты не смог ничего найти")
                }
            }
        }
        if( choice === "1"){
            alert("вы не можете пройти без пароля\n"+
                "найдите закономерность в ответах и выберите правильный вариант\n"+
                "1 вопрос кем притворялся Пугачев:0 - петр3, 1 - Пал лаич, 2 - Тун тун сахур\n"+
                "2 ворос как у меня дела: 0 - Пойдет, 1 - хорошо, 3 - плохо\n"+
                "3 ворос кого вы предпочли бы встретить в лесу: 0 - МУЖЧИНУ, 1 - МЕДВЕДЯ, 3 - МеНЯ\n"+
                "4 вот такой *****: 0 - Хамам, 1 - Бурмалда, 3 - Славик\n"
            )
            const password = prompt()
            if(password === "0030"){
                alert("вы прошли в северную, обнаружив там вы нашли включеный пк")
                const vibor  = confirm("хотите ли вы прочитать файл на пк ")
                if(vibor){
                    alert("все что я понял этот копмлекс были привезены тяжело больные люди для опытов, но имя тем кто этим всем заведовал было удалено\n"+
                        "везде кроме кроме главного пк с которого мне и нужно скопировать инфармацию. Я понял что этот копмлекс принадлежит крупной фармо компании БАЙЕР\n"+
                        "я должен помочь им выяснить кто виновен виновен в ужасах в копмлексе и не дать этой информации попасть в мировое инфо-поле"
                    )
                }
                else{
                    alert("не мне чет впадлу")
                }
            }
        }
        if(choice === "2"){
            alert("вы прошли в большой зал залитый светом. Длинные столы с компьютерами от стены до стены и все они\n"+
                "залиты кровью вдруг  я задел локтем монитор и тут из двери в конце зала раздался визг и в дверь начали стучать\n "+
                "и тутя заметил так нужный мне ключ карту в другом углу в конце кабинета и понял что  мне нужно забрать его и пройти в ту дверь но времени не так много"
            )
           alert("реши загадку\n"+
            "весной и летом одним цветом")
            const action = prompt()
            for(i = 0; i < 10; i++){
                if(action === "рояль"){
                    alert("win")
                    inventory.push("ключ карта от 3 этажа")
                }
                else{
                    alert("дверь разлетелась на щепки, что - то оттдаленное похоже на человека влетело в комнату и тут я понял мне не жить\n"+
                        "ПОТРАЧЕНО"
                    )
                    break
                }
            }
        }
        if(choice === "3" && inventory.includes("ключ карта от 3 этажа")){
            alert("я попал на 3 этаж .Это финишная прямая я понял что выход близко ном мое с состояние ухудшается и мне осталось не долго")
            const choice = prompt("")
        }
    }
}